//=============================================================================
//
// ゲーム画面処理 [game.h]
// Author : YUKI TAKAHASHI
//
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// ゲームの状態
//=============================================================================
typedef enum
{
	GAMESTATE_NONE = 0,	// 何もしていない状態
	GAMESTATE_NORMAL,	// 通常状態
	GAMESTATE_END,		// ゲーム終了状態(画面遷移待ち状態)
	GAMESTATE_PAUSE,	// ポーズ状態
	GAMESTATE_MAX		// 状態の最大数
} GAMESTATE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitGame(HWND hWnd);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);

void SetGameState(GAMESTATE state);

GAMESTATE *GetGameState(void);

#endif