//=============================================================================
//
// ポリゴン処理 [MeshField.h]
// Author:RYO KANDA
//
//=============================================================================
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MESHFIELD_SIZE		(250)
#define MESHFIELD_NUMLENGTH	(2)
#define MESHFIELD_NUMSIDE	(2)

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMeshField(void);
void UninitMeshField(void);
void UpdateMeshField(void);
void DrawMeshField(void);

void ChangeColor(D3DXCOLOR col, int nNumber);	// 色の変更

#endif
