//=============================================================================
//
// リザルト画面処理 [result.h]
// Author : DAIKI TSUCHIDA
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

void SetResult(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXCOLOR col, float fWidth, float fHeight, int nType);

#endif
