//=============================================================================
//
// チュートリアル画面処理 [tutorial.h]
// Author : YUKI TAKAHASHI
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// チュートリアルの状態
//=============================================================================
typedef enum
{
	TUTOSTATE_NONE = 0,	// 何もしていない状態
	TUTOSTATE_NORMAL,	// 通常状態
	TUTOSTATE_END,		// チュートリアル終了状態(画面遷移待ち状態)
	TUTOSTATE_PAUSE,	// ポーズ状態
	TUTOSTATE_MAX		// 状態の最大数
} TUTOSTATE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitTutorial(HWND hWnd);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

void SetTutoState(TUTOSTATE state);
TUTOSTATE *GetTutoState(void);

#endif
